app/Controllers/Panel.php

SELECT COUNT(*) AS `numrows` FROM `usuarios`
SELECT COUNT(*) AS `numrows` FROM `clientes`
SELECT COUNT(*) AS `numrows` FROM `proveedores`
---
    public function index()
    {
        if (!isset($this->sesion->id_usuario)) {
            return redirect()->to(base_url() . 'public/login');
        }
        //Esto seria una consulta,  "Select * from clientes"
        $usuarios = $this->usuarios->findAll();
        $clientes = $this->clientes->findAll();
        $proveedores = $this->proveedores->findAll();

        $totalUsuarios = $this->usuarios->countAllResults();
        $totalClientes = $this->clientes->countAllResults();
        $totalProveedores = $this->proveedores->countAllResults();