app/Controllers/Proveedores.php

INSERT INTO `proveedores` (`razon_social`, `cuit`, `telefono`, `email`, `direccion`) VALUES ('Lautaro alfajores', '201584857', '343615486', 'lautaro@gmail.com', 'Santa fe, 1234')
---
    public function guardar()
    {
        if (!isset($this->sesion->id_usuario)) {
            return redirect()->to(base_url('login'));
        }

        // Guardamos los datos del formulario
        $this->proveedores->save([
            'razon_social' => $this->request->getPost('razon_social'),
            'cuit'         => $this->request->getPost('cuit'),
            'telefono'     => $this->request->getPost('telefono'),
            'email'        => $this->request->getPost('email'),
            'direccion'    => $this->request->getPost('direccion'),
        ]);