app/Controllers/Proveedores.php

INSERT INTO `transacciones` (`proveedor_id`, `cliente_id`, `tipo_comprobante`, `numero_comprobante`, `fecha`, `monto`, `observaciones`, `id_usuario`, `pagado`, `fecha_alta`, `fecha_edicion`) VALUES ('7', NULL, 'nota_pedido', 'NP-0007', '2026-01-22', 19500, '', '5', 0, '2026-01-22 20:33:02', '2026-01-22 20:33:02')
---
        ];

        $builder = $db->table('transacciones');
        $insert_ok = $builder->insert($transaccion_data);