app/Controllers/Transacciones.php

        $data['archivo_pdf'] = null;
    }

    $transaccion_id = $this->transacciones->insert($data);
---
INSERT INTO `transacciones` (`tipo_comprobante`, `numero_comprobante`, `fecha`, `monto`, `observaciones`, `forma_pago`, `pagado`, `cliente_id`, `proveedor_id`, `archivo_pdf`, `fecha_alta`, `fecha_edicion`) VALUES ('factura', '007802', '2026-02-25', '30000.00', '', 'transferencia', 0, '8', NULL, NULL, '2026-02-25 14:16:09', '2026-02-25 14:16:09')