app/Controllers/Usuarios.php

    public function guardar()
    {
        if (!isset($this->sesion->id_usuario)) {
            return redirect()->to(base_url() . 'public/login');
        }

        $hash = password_hash($this->request->getPost('password'), PASSWORD_DEFAULT);

        $this->usuarios->save([
            'usuario' => $this->request->getPost('usuario'),
            'nombre' => $this->request->getPost('nombre'),
            'password' => $hash,
        ]);
---
INSERT INTO `usuarios` (`usuario`, `nombre`, `password`) VALUES ('alesionunez', 'Alesio', '$2y$10$WU6yBFJZNwQgG9B8.r3GbOcg6yZlKj7EsANCSsYkyqrCj2mlGN3tW')

    public function actualizar($id)
    {
        if (!isset($this->sesion->id_usuario)) {
            return redirect()->to(base_url() . 'public/login');
        }

        $data = [
            'usuario' => $this->request->getPost('usuario'),
            'nombre'  => $this->request->getPost('nombre'),
        ];

        $clave_nueva = $this->request->getPost('password');

        if (!empty($clave_nueva)) {
            $hash = password_hash($clave_nueva, PASSWORD_DEFAULT);
            $data['password'] = $hash;
        }

        $this->usuarios->update($id, $data);
---
UPDATE `usuarios` SET `usuario` = 'admin', `nombre` = 'admin', `password` = '$2y$10$frd2kEbg5nUfyA2gwWqcJ.VyTJNasMn9K3hvg7dUVjPECsJSPJwXy'
WHERE `usuarios`.`id` IN ('5')