app/Models/ProductosModel.php

    public function getProductosActivos()
    {
        return $this->where('fecha_borrado', null)
                    ->orderBy('nombre', 'ASC')
                    ->findAll();
---
SELECT *
FROM `productos`
WHERE `fecha_borrado` IS NULL
AND `productos`.`fecha_borrado` IS NULL
ORDER BY `nombre` ASC