app/Models/TransaccionesModel.php

SELECT SUM(`monto`) AS `monto`
FROM `transacciones`
WHERE `cliente_id` = '8'
AND `tipo_comprobante` IN ('factura','nota_debito')
SELECT SUM(`monto`) AS `monto`
FROM `transacciones`
WHERE `cliente_id` = '8'
AND `tipo_comprobante` IN ('nota_credito','pago')
---
    public function calcularSaldoCliente($cliente_id)
    {
        $cargos = $this->selectSum('monto')
            ->where('cliente_id', $cliente_id)
            ->whereIn('tipo_comprobante', ['factura', 'nota_debito'])
            ->get()
            ->getRowArray();

        $total_cargos = $cargos['monto'] ?? 0;

        $descargos = $this->selectSum('monto')
            ->where('cliente_id', $cliente_id)
            ->whereIn('tipo_comprobante', ['nota_credito', 'pago'])
            ->get()
            ->getRowArray();

SELECT SUM(`monto`) AS `monto`
FROM `transacciones`
WHERE `proveedor_id` = '9'
AND `tipo_comprobante` IN ('factura','nota_debito')
SELECT SUM(`monto`) AS `monto`
FROM `transacciones`
WHERE `proveedor_id` = '2'
AND `tipo_comprobante` IN ('factura','nota_debito')
---
    public function calcularSaldoProveedor($proveedor_id)
    {
        $cargos = $this->selectSum('monto')
            ->where('proveedor_id', $proveedor_id)
            ->whereIn('tipo_comprobante', ['factura', 'nota_debito'])
            ->get()
            ->getRowArray();

        $total_cargos = $cargos['monto'] ?? 0;

        $descargos = $this->selectSum('monto')
            ->where('proveedor_id', $proveedor_id)
            ->whereIn('tipo_comprobante', ['nota_credito', 'pago'])
            ->get()
            ->getRowArray();

SELECT `cliente_id`
FROM `transacciones`
WHERE `cliente_id` IS NOT NULL
GROUP BY `cliente_id`
---
    public function getSaldosClientes()
    {
        $clientes = $this->db->table('transacciones')
            ->select('cliente_id')
            ->where('cliente_id IS NOT NULL')
            ->groupBy('cliente_id')
            ->get()
            ->getResultArray();

SELECT `proveedor_id`
FROM `transacciones`
WHERE `proveedor_id` IS NOT NULL
GROUP BY `proveedor_id`
---
    public function getSaldosProveedores()
    {
        $proveedores = $this->db->table('transacciones')
            ->select('proveedor_id')
            ->where('proveedor_id IS NOT NULL')
            ->groupBy('proveedor_id')
            ->get()
            ->getResultArray();

SELECT SUM(`monto`) AS `total`
FROM `transacciones`
WHERE `tipo_comprobante` = 'pago'
AND `cliente_id` IS NOT NULL
SELECT SUM(`monto`) AS `total`
FROM `transacciones`
WHERE `tipo_comprobante` = 'pago'
AND `proveedor_id` IS NOT NULL
---
    public function getTotalesCaja()
{
    $ingresos = $this->db->table('transacciones')
        ->selectSum('monto', 'total')//suma todos los campos de la columna monto y se le asigna el alias total
        ->where('tipo_comprobante', 'pago')
        ->where('cliente_id IS NOT NULL')
        ->get()
        ->getRow()
        ->total ?? 0;

    $egresos = $this->db->table('transacciones')
        ->selectSum('monto', 'total')
        ->where('tipo_comprobante', 'pago')
        ->where('proveedor_id IS NOT NULL')
        ->get()
        ->getRow()
        ->total ?? 0;