app/Models/TransaccionesDetalleModel.php

SELECT `transacciones_detalle`.*, `productos`.`codigo`, `productos`.`nombre` as `nombre_producto`, `productos`.`tipo`
FROM `transacciones_detalle`
JOIN `productos` ON `productos`.`id` = `transacciones_detalle`.`producto_id`
WHERE `transacciones_detalle`.`transaccion_id` = '50'
---
    public function getDetalleTransaccion($transaccion_id)
    {
        return $this->select('
                transacciones_detalle.*,
                productos.codigo,
                productos.nombre as nombre_producto,
                productos.tipo
            ')
            ->join('productos', 'productos.id = transacciones_detalle.producto_id')
            ->where('transacciones_detalle.transaccion_id', $transaccion_id)
            ->findAll();

INSERT INTO `transacciones_detalle` (`transaccion_id`, `producto_id`, `cantidad`, `precio_unitario`, `subtotal`) VALUES (90, '2', 1, 15000, 15000)
---
    public function guardarDetalle($transaccion_id, $items)
    {
        $this->db->transStart();

        foreach ($items as $item) {
            $data = [
                'transaccion_id'   => $transaccion_id,
                'producto_id'      => $item['producto_id'],
                'cantidad'         => $item['cantidad'],
                'precio_unitario'  => $item['precio_unitario'],
                'subtotal'         => $item['subtotal']
            ];

            $this->insert($data);